# `Business Understanding`

Train a machine learning model to predict whether a customer is male or female

# `Data Understanding`

## Importation of all necessary packages

In [1]:
# EDA
import pandas  as pd
import numpy as np
import matplotlib.pyplot as plt

#Machine Learning
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder, OneHotEncoder

#Utilities
import warnings
warnings.filterwarnings('ignore')

## Read Data

In [2]:
df = pd.read_csv(r"C:\Users\user\Videos\py\dollar_tree-231012-195712.csv")
df.head()

,index,Date,Year,Month,Customer Age,Customer Gender,Country,State,Product Category,Sub Category,Quantity,Unit Cost,Unit Price,Cost,Revenue,Column1
0,0,2/19/2016,2016.0,February,29.0,F,United States,Washington,Accessories,Tires and Tubes,1.0,80.00,109.000000,80.0,109.0,NaN
1,1,2/20/2016,2016.0,February,29.0,F,United States,Washington,Clothing,Gloves,2.0,24.50,28.500000,49.0,57.0,NaN
2,2,2/27/2016,2016.0,February,29.0,F,United States,Washington,Accessories,Tires and Tubes,3.0,3.67,5.000000,11.0,15.0,NaN
3,3,3/12/2016,2016.0,March,29.0,F,United States,Washington,Accessories,Tires and Tubes,2.0,87.50,116.500000,175.0,233.0,NaN
4,4,3/12/2016,2016.0,March,29.0,F,United States,Washington,Accessories,Tires and Tubes,3.0,35.00,41.666667,105.0,125.0,NaN

## Perform a `brief` EDA  (info(), describe(), corr() etc)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34867 entries, 0 to 34866
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   index             34867 non-null  int64
 1   Date              34866 non-null  object
 2   Year              34866 non-null  float64
 3   Month             34866 non-null  object
 4   Customer Age      34866 non-null  float64
 5   Customer Gender   34866 non-null  object
 6   Country           34866 non-null  object
 7   State             34866 non-null  object
 8   Product Category  34866 non-null  object
 9   Sub Category      34866 non-null  object
 10  Quantity          34866 non-null  float64
 11  Unit Cost         34866 non-null  float64
 12  Unit Price        34866 non-null  float64
 13  Cost              34866 non-null  float64
 14  Revenue           34867 non-null  float64
 15  Column1           2574 non-null   float64
dtypes: float64(8), int64(1), object(7)
memory usage: 4.3+ MB

In [4]:
df.describe()

,index,Year,Customer Age,Quantity,Unit Cost,Unit Price,Cost,Revenue,Column1
count,34867.000000,34866.000000,34866.000000,34866.000000,34866.000000,34866.000000,34866.000000,34867.000000,2574.000000
mean,17433.000000,2015.569237,36.382895,2.002524,349.880567,389.232485,576.004532,640.870093,688.054913
std,10065.380254,0.495190,11.112902,0.813936,490.015846,525.319091,690.500395,736.640033,774.200897
min,0.000000,2015.000000,17.000000,1.000000,0.670000,0.666667,2.000000,2.000000,2.000000
25%,8716.500000,2015.000000,28.000000,1.000000,45.000000,53.666667,85.000000,102.000000,104.250000
50%,17433.000000,2016.000000,35.000000,2.000000,150.000000,179.000000,261.000000,319.000000,390.500000
75%,26149.500000,2016.000000,44.000000,3.000000,455.000000,521.000000,769.000000,902.000000,975.750000
max,34866.000000,2016.000000,87.000000,3.000000,3240.000000,5082.000000,3600.000000,5082.000000,3681.000000

In [10]:
df.isnull().sum()

index                   0
Date                    1
Year                    1
Month                   1
Customer Age            1
Customer Gender         1
Country                 1
State                   1
Product Category        1
Sub Category            1
Quantity                1
Unit Cost               1
Unit Price              1
Cost                    1
Revenue                 0
Column1             32293
dtype: int64

# `Data Preparation`

## Data Cleaning

In [11]:
df.head()

,index,Date,Year,Month,Customer Age,Customer Gender,Country,State,Product Category,Sub Category,Quantity,Unit Cost,Unit Price,Cost,Revenue,Column1
0,0,2/19/2016,2016.0,February,29.0,F,United States,Washington,Accessories,Tires and Tubes,1.0,80.00,109.000000,80.0,109.0,NaN
1,1,2/20/2016,2016.0,February,29.0,F,United States,Washington,Clothing,Gloves,2.0,24.50,28.500000,49.0,57.0,NaN
2,2,2/27/2016,2016.0,February,29.0,F,United States,Washington,Accessories,Tires and Tubes,3.0,3.67,5.000000,11.0,15.0,NaN
3,3,3/12/2016,2016.0,March,29.0,F,United States,Washington,Accessories,Tires and Tubes,2.0,87.50,116.500000,175.0,233.0,NaN
4,4,3/12/2016,2016.0,March,29.0,F,United States,Washington,Accessories,Tires and Tubes,3.0,35.00,41.666667,105.0,125.0,NaN

## Divide data into input and output

In [13]:
df.columns

Index(['index', 'Date', 'Year', 'Month', 'Customer Age', 'Customer Gender',
       'Country', 'State', 'Product Category', 'Sub Category', 'Quantity',
       'Unit Cost', 'Unit Price', 'Cost', 'Revenue', 'Column1'],
      dtype='object')

In [14]:
df = df.drop(['Column1'], axis = 1)

In [16]:
df.columns

Index(['index', 'Date', 'Year', 'Month', 'Customer Age', 'Customer Gender',
       'Country', 'State', 'Product Category', 'Sub Category', 'Quantity',
       'Unit Cost', 'Unit Price', 'Cost', 'Revenue'],
      dtype='object')

In [20]:
x = df[['Customer Age', 'Country','Product Category','Quantity', 'Unit Cost', 'Unit Price',]]
x.head(2)

,Customer Age,Country,Product Category,Quantity,Unit Cost,Unit Price
0,29.0,United States,Accessories,1.0,80.0,109.0
1,29.0,United States,Clothing,2.0,24.5,28.5

In [21]:
y =df['Customer Gender']

In [24]:
X_train, X_test, y_train, y_test  = train_test_split(x, y, test_size=0.80, random_state=20)

In [25]:
X_train

,Customer Age,Country,Product Category,Quantity,Unit Cost,Unit Price
12887,40.0,United Kingdom,Bikes,1.0,2384.00,2628.0
6936,19.0,United States,Accessories,1.0,420.00,469.0
1010,24.0,Germany,Accessories,1.0,210.00,292.0
15627,49.0,United States,Accessories,1.0,189.00,239.0
10977,33.0,United States,Accessories,2.0,350.00,407.0
...,...,...,...,...,...,...
3915,36.0,Germany,Clothing,1.0,36.00,47.0
31962,21.0,United States,Accessories,1.0,15.00,17.0
23452,33.0,Germany,Clothing,1.0,1000.00,1617.0
23775,28.0,Germany,Accessories,3.0,6.67,10.0
27098,47.0,United States,Bikes,2.0,1192.00,1074.5

## Encoding

### 1. Encode the target column (the labels)

In [26]:
y_train.unique()

array(['M', 'F'], dtype=object)

In [28]:
y_test

22737    F
16727    M
24234    M
33412    M
5927     M
        ..
34855    M
33505    F
4136     F
31267    F
5098     M
Name: Customer Gender, Length: 27894, dtype: object

### 2. Encode categorical columns

In [29]:
label_encoder = LabelEncoder()

y_train_encoded = label_encoder.fit_transform(y_train)
y_test_encoded = label_encoder.transform(y_test)

ValueError: y contains previously unseen labels: nan

### Replace original categorical columns with encoded ones
##### Don't forget Reset indices to ensure proper alignment when I concatenate

# `Modeling`

# `Evaluation`

### Plot the confusion Matrix using  `matplotlib` and or `seaborn`

### Build a classification Report